Documents/Лео_УстановкаПланаПоступленияНаСклад/Лео_УстановкаПланаПоступленияНаСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Лео_УстановкаПланаПоступленияНаСклад</name>
  <registerRecords>InformationRegister.Лео_ПланПоступленияНаСклад</registerRecords>
  <attributes>
    <name>План</name>
    <type>
      <types>CatalogRef.Лео_ПланыПоступленияНаСклад</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПлановыеЗначения</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭкстраЗаказ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

InformationRegisters/Лео_ПланПоступленияНаСклад/Лео_ПланПоступленияНаСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Лео_ПланПоступленияНаСклад</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>План</name>
    <type>
      <types>CatalogRef.Лео_ПланыПоступленияНаСклад</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭкстраЗаказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Documents/Лео_УстановкаПланаПоступленияНаСклад/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Лео_ПланПоступленияНаСклад.Записывать = Истина;
	Движения.Лео_ПланПоступленияНаСклад.Очистить();
	Для Каждого ТекСтрокаПлановыеЗначения Из ПлановыеЗначения Цикл
		Движение = Движения.Лео_ПланПоступленияНаСклад.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаПлановыеЗначения.Номенклатура;
		Движение.Дата = ТекСтрокаПлановыеЗначения.Дата;
		Движение.План = План;
		Движение.ЭкстраЗаказ = ТекСтрокаПлановыеЗначения.ЭкстраЗаказ;
		Движение.Количество = ТекСтрокаПлановыеЗначения.Количество;
	КонецЦикла;

КонецПроцедуры
